<template>
	<view class="content">
		<view class="box">
			<l-ecg ref="ecgRef"></l-ecg>
		</view>
	</view>
</template>

<script setup>
	import {
		ref,
		onMounted,
		nextTick,
		onUnmounted
	} from 'vue'
	const value = [122, 122, 122, 122, -122, -122, -122, -122, -122, -122, -122, -122, -122, -122, 122, 122, 122, 123, 125,
		127, 130, 133, 135, 137, 138, 139, 140, 140, 139, 138, 136, 134, 130, 127, 125, 124, 123, 122, 122, 122, 122,
		122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 121, 119, 116, 113, 111, 132, 151,
		171, 190, 210, 229, 210, 190, 171, 151, 132, 112, 114, 117, 120, 122, 122, 122, 122, 122, 122, 122, 122, 122,
		122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 123,
		124, 124, 126, 128, 131, 133, 134, 136, 140, 143, 144, 146, 149, 150, 152, 153, 153, 154, 155, 156, 157, 156,
		155, 153, 153, 152, 150, 149, 146, 145, 142, 138, 135, 133, 129, 127, 124, 123, 122, 122, 122, 122, 122, 122,
		122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122,
		122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122,
		122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122,
		122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122,
		122, 122, 122, 122, 122, 122, 122, 122, 122, 122, 122
	]
	const ecgRef = ref(null)

	onMounted(() => {
		ecgRef.value.init({
			// 小格和大格的border color
			lineColor: ['#c7dff5', '#63b3f8'],
			ampTime: 'Amp: 10mm/mv  Time: 25mm/sec',
			textColor: '#000',
			wave: {
				// ecg
				// 1秒多少个点
				frameSize: 250,
				yMax: 250,
				waveHeight: 100,
				// 每次画几个点
				step: 10,
				// 扫纸速度，1 默认 表示 25mm/s (1秒25个小格子 每个小格子0.04s)。 0.5表示扫纸速度为 12.5mm/s。2表示扫纸速度为 50mm/s。
				speedRatio: 1,
				lineColor: 'red'
			},
		})
		nextTick(() => {
			setTimeout(() => {

				resume()
			}, 1000)
		})
	})
	
	onUnmounted( () => {
		pause()
	})

	const resume = () => {
		ecgRef.value.update(value)
		ecgRef.value.resume()
		setInterval(() => {
			ecgRef.value.update(value)
		}, 1000)
	}
	const pause = () => {
		ecgRef.value.pause()
	}
</script>

<style lang="scss" scoped>
	.content {
		width: 100%;
		height: 100%;
	}

	.box {
		width: 85%;
		height: 85%;
		background-color: #fff;
		border-radius: 40rpx;
	}
</style>